Import Libraries & Load Data

In [3]:
# Import pandas library for data analysis
import pandas as pd

# Load the dataset into a pandas DataFrame
# Replace 'salaries_by_college_major.csv' with your actual file path if needed
df = pd.read_csv("salaries_by_college_major.csv")

# Show the first 5 rows of the dataset to preview its structure
df.head()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,Accounting,46000.0,77100.0,42200.0,152000.0,Business
1,Aerospace Engineering,57700.0,101000.0,64300.0,161000.0,STEM
2,Agriculture,42600.0,71900.0,36300.0,150000.0,Business
3,Anthropology,36800.0,61500.0,33800.0,138000.0,HASS
4,Architecture,41600.0,76800.0,50600.0,136000.0,Business

In [4]:
# The shape attribute tells us the number of rows and columns in the dataframe
df.shape

(51, 6)

In [5]:
# The columns attribute gives us the labels of all columns in the dataframe
df.columns

Index(['Undergraduate Major', 'Starting Median Salary',
       'Mid-Career Median Salary', 'Mid-Career 10th Percentile Salary',
       'Mid-Career 90th Percentile Salary', 'Group'],
      dtype='object')

In [9]:
# Check the last 5 rows of the dataframe
# Often junk rows appear at the bottom
df.tail()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
46,Psychology,35900.0,60400.0,31600.0,127000.0,HASS
47,Religion,34100.0,52000.0,29700.0,96400.0,HASS
48,Sociology,36500.0,58200.0,30700.0,118000.0,HASS
49,Spanish,34000.0,53100.0,31000.0,96400.0,HASS
50,Source: PayScale Inc.,NaN,NaN,NaN,NaN,NaN

In [6]:
# .isna() returns True for missing values
# .sum() gives us the total number of missing values in each column
df.isna().sum()

Undergraduate Major                  0
Starting Median Salary               1
Mid-Career Median Salary             1
Mid-Career 10th Percentile Salary    1
Mid-Career 90th Percentile Salary    1
Group                                1
dtype: int64

In [10]:
# Drop rows with NaN values to remove junk data
clean_df = df.dropna()

# Verify the last 5 rows again to confirm the bad row was removed
clean_df.tail()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
45,Political Science,40800.0,78200.0,41200.0,168000.0,HASS
46,Psychology,35900.0,60400.0,31600.0,127000.0,HASS
47,Religion,34100.0,52000.0,29700.0,96400.0,HASS
48,Sociology,36500.0,58200.0,30700.0,118000.0,HASS
49,Spanish,34000.0,53100.0,31000.0,96400.0,HASS

## Optional

In [11]:
# .info() gives us a concise summary:
# - number of entries
# - column names
# - non-null counts
# - data types
clean_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 50 entries, 0 to 49
Data columns (total 6 columns):
 #   Column                             Non-Null Count  Dtype
---  ------                             --------------  -----
 0   Undergraduate Major                50 non-null     object
 1   Starting Median Salary             50 non-null     float64
 2   Mid-Career Median Salary           50 non-null     float64
 3   Mid-Career 10th Percentile Salary  50 non-null     float64
 4   Mid-Career 90th Percentile Salary  50 non-null     float64
 5   Group                              50 non-null     object
dtypes: float64(4), object(2)
memory usage: 2.7+ KB

In [12]:
# .describe() provides summary statistics of numerical columns
clean_df.describe()

,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary
count,50.000000,50.00000,50.000000,50.000000
mean,44310.000000,74786.00000,43408.000000,142766.000000
std,9360.866217,16088.40386,12000.779567,27851.249267
min,34000.000000,52000.00000,26700.000000,96400.000000
25%,37050.000000,60825.00000,34825.000000,124250.000000
50%,40850.000000,72000.00000,39400.000000,145500.000000
75%,49875.000000,88750.00000,49850.000000,161750.000000
max,74300.000000,107000.00000,71900.000000,210000.000000

## Find College Major with Highest Starting Salaries

In [15]:
# Access the 'Starting Median Salary' column
# This will return a pandas Series containing all starting salaries
clean_df['Starting Median Salary']
# Find the maximum value in 'Starting Median Salary'
clean_df['Starting Median Salary'].max()

74300.0

In [16]:
# Get the index of the row with the maximum starting salary
clean_df['Starting Median Salary'].idxmax()

43

In [17]:
# Use .loc to retrieve the major at index 43
clean_df['Undergraduate Major'].loc[43]

'Physician Assistant'

In [18]:
# Retrieve the entire row for index 43
clean_df.loc[43]

Undergraduate Major                  Physician Assistant
Starting Median Salary                           74300.0
Mid-Career Median Salary                         91700.0
Mid-Career 10th Percentile Salary                66400.0
Mid-Career 90th Percentile Salary               124000.0
Group                                               STEM
Name: 43, dtype: object

### College Major with Highest Mid-Career Salary

In [19]:
# Find the index of the max mid-career salary
highest_mid_idx = clean_df['Mid-Career Median Salary'].idxmax()

# Retrieve the major and salary
highest_mid_major = clean_df['Undergraduate Major'].loc[highest_mid_idx]
highest_mid_salary = clean_df['Mid-Career Median Salary'].loc[highest_mid_idx]

highest_mid_major, highest_mid_salary

('Chemical Engineering', 107000.0)

### College Major with Lowest Starting Salary

In [20]:
# Find the index of the min starting salary
lowest_start_idx = clean_df['Starting Median Salary'].idxmin()

# Retrieve the major and salary
lowest_start_major = clean_df['Undergraduate Major'].loc[lowest_start_idx]
lowest_start_salary = clean_df['Starting Median Salary'].loc[lowest_start_idx]

lowest_start_major, lowest_start_salary

('Spanish', 34000.0)

### College Major with Lowest Mid-Career Salary

In [22]:
# Find the index of the min mid-career salary
lowest_mid_idx = clean_df['Mid-Career Median Salary'].idxmin()

# Retrieve the major and salary
lowest_mid_major = clean_df['Undergraduate Major'].loc[lowest_mid_idx]
lowest_mid_salary = clean_df['Mid-Career Median Salary'].loc[lowest_mid_idx]

lowest_mid_major, lowest_mid_salary

('Education', 52000.0)

## Majors with the Most Potential vs Lowest Risk

In [23]:
# Calculate the difference between 90th percentile and 10th percentile salaries
spread_col = clean_df['Mid-Career 90th Percentile Salary'] - clean_df['Mid-Career 10th Percentile Salary']

# Insert 'Spread' column at position 1 (second column in the DataFrame)
clean_df.insert(1, 'Spread', spread_col)

# Display first 5 rows to confirm insertion
clean_df.head()

,Undergraduate Major,Spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,Accounting,109800.0,46000.0,77100.0,42200.0,152000.0,Business
1,Aerospace Engineering,96700.0,57700.0,101000.0,64300.0,161000.0,STEM
2,Agriculture,113700.0,42600.0,71900.0,36300.0,150000.0,Business
3,Anthropology,104200.0,36800.0,61500.0,33800.0,138000.0,HASS
4,Architecture,85400.0,41600.0,76800.0,50600.0,136000.0,Business

In [24]:
# Sort the DataFrame by 'Spread' in ascending order (default)
# This means majors with the smallest spread come first
low_risk = clean_df.sort_values('Spread')

# Show only 'Undergraduate Major' and 'Spread' for clarity
low_risk[['Undergraduate Major', 'Spread']].head()

           Undergraduate Major   Spread
40                     Nursing  50700.0
43         Physician Assistant  57600.0
41                   Nutrition  65300.0
49                     Spanish  65400.0
27  Health Care Administration  66400.0

### Top 5 Majors with Highest 90th Percentile Salaries (Highest Potential)

In [25]:
# Sort by 'Mid-Career 90th Percentile Salary' in descending order
# to get the highest values at the top
highest_potential = clean_df.sort_values('Mid-Career 90th Percentile Salary', ascending=False)

# Display top 5 majors with their 90th percentile salaries
highest_potential[['Undergraduate Major', 'Mid-Career 90th Percentile Salary']].head()

     Undergraduate Major  Mid-Career 90th Percentile Salary
17             Economics                           210000.0
22               Finance                           195000.0
8   Chemical Engineering                           194000.0
37                  Math                           183000.0
44               Physics                           178000.0

### Majors with the Greatest Spread

In [26]:
# Sort by 'Spread' in descending order to see the largest differences
greatest_spread = clean_df.sort_values('Spread', ascending=False)

# Display top 5 majors with their spread
greatest_spread[['Undergraduate Major', 'Spread']].head()

   Undergraduate Major    Spread
17           Economics  159400.0
22             Finance  147800.0
37                Math  137800.0
36           Marketing  132900.0
42          Philosophy  132500.0

## Grouping and Pivoting Data

In [29]:
# Group the DataFrame by 'Group' column and count the entries in each group
# This shows how many majors belong to STEM, HASS, and Business categories
clean_df.groupby('Group').count()

,Undergraduate Major,Spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary
Group,,,,,,
Business,12,12,12,12,12,12
HASS,22,22,22,22,22,22
STEM,16,16,16,16,16,16

In [32]:
# Group by 'Group' and calculate the mean for each salary column
# This gives us the average salaries for each category of degrees
#clean_df.groupby('Group').mean()

# Format floating point numbers with commas and 2 decimal places
pd.options.display.float_format = '{:,.2f}'.format

# Re-run the group mean calculation with nicer formatting
clean_df.groupby('Group').mean(numeric_only=True)

,Spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary
Group,,,,,
Business,"103,958.33","44,633.33","75,083.33","43,566.67","147,525.00"
HASS,"95,218.18","37,186.36","62,968.18","34,145.45","129,363.64"
STEM,"101,600.00","53,862.50","90,812.50","56,025.00","157,625.00"

In [42]:
# Define the columns we want to average
salary_cols = [
    'Starting Median Salary',
    'Mid-Career Median Salary',
    'Mid-Career 10th Percentile Salary',
    'Mid-Career 90th Percentile Salary'  # remove 25th & 75th percentile
]
# Group by 'Group' and compute means only for these columns
clean_df.groupby('Group')[salary_cols].mean()

,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary
Group,,,,
Business,"44,633.33","75,083.33","43,566.67","147,525.00"
HASS,"37,186.36","62,968.18","34,145.45","129,363.64"
STEM,"53,862.50","90,812.50","56,025.00","157,625.00"

In [43]:
# Strip spaces from column names
clean_df.columns = clean_df.columns.str.strip()

In [44]:
pd.options.display.float_format = '{:,.2f}'.format
clean_df.groupby('Group')[salary_cols].mean()

,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary
Group,,,,
Business,"44,633.33","75,083.33","43,566.67","147,525.00"
HASS,"37,186.36","62,968.18","34,145.45","129,363.64"
STEM,"53,862.50","90,812.50","56,025.00","157,625.00"